[
    {
        "id": 0,
        "title": "Rolytics",
        "description": "Rolytics is a custom-built analytics and remote control platform designed to empower Roblox developers with deeper insights and enhanced control over their games. It bridges the gap left by Roblox's native tools, offering detailed metrics on player behavior, in-game economics, performance, and social interactions, enabling developers to make data-driven decisions to optimize their experiences. Built using a Node.js + Express API, a React + Vite-powered frontend, and deployed via Docker, Nginx, and FreeDNS, Rolytics features a real-time dashboard that doubles as a live command and control center. The platform includes an A/B testing framework for experimenting with gameplay and monetization, remote command execution for live game servers, and live visualizations of server performance and client metrics (including FPS, memory, and physics simulations). Additionally, I developed an official Roblox Studio plugin to securely link in-game data to the Rolytics backend. This project solidified my skills in full-stack web development, REST API design, plugin architecture, and DevOps workflows, while also sharpening my focus on developer usability and scalable infrastructure.",
        "languages": [
            "javascript",
            "lua"
        ],
        "technologies": [
            "git",
            "github",
            "github-actions",
            "jest",
            "docker",
            "nginx",
            "expressjs",
            "nodejs",
            "vitejs",
            "react",
            "eslint",
            "sqlite"
        ],
        "date": {
            "start": {
                "year": 2024,
                "month": 7,
                "day": null
            },
            "end": {
                "year": null,
                "month": null,
                "day": null
            },
            "isOngoing": true
        },
        "repoLink": "https://github.com/b-smyers/rolytics",
        "link": "https://rolytics.bot.nu/",
        "images": [
            "/images/projects/rolytics1.jpg",
            "/images/projects/rolytics2.jpg",
            "/images/projects/rolytics3.jpg",
            "/images/projects/rolytics4.jpg"
        ],
        "members": [
            {
                "name": "Brendan Smyers",
                "role": "Lead Developer"
            }
        ]
    },
    {
        "id": 1,
        "title": "Dungeon Odyssey",
        "description": "Dungeon Odyssey is a custom-built dungeon crawler focused on procedural generation, modular gameplay systems, and party-based combat. The project was designed to explore scalable game architecture and deepen my understanding of systems design in a game development context. Throughout development, I created reusable services for inventory, item modeling, experience systems, and entity management; laying the groundwork for a maintainable, extensible codebase. I also implemented client/server separation and basic cheat-prevention measures to simulate real-world multiplayer security considerations. This project strengthened my skills in clean architecture, game systems engineering, and balancing scope with complexity. It also provided hands-on experience with designing emergent gameplay from procedural systems.",
        "languages": [
            "lua"
        ],
        "technologies": [],
        "date": {
            "start": {
                "year": 2020,
                "month": 6,
                "day": null
            },
            "end": {
                "year": 2025,
                "month": 2,
                "day": 12
            },
            "isOngoing": false
        },
        "repoLink": null,
        "link": "https://www.roblox.com/games/5195557959/Dungeon-Odyssey",
        "images": [
            "/images/projects/dungeon_odyssey1.png",
            "/images/projects/dungeon_odyssey2.jpg",
            "/images/projects/dungeon_odyssey3.jpg",
            "/images/projects/dungeon_odyssey4.jpg"
        ],
        "members": [
            {
                "name": "Brendan Smyers",
                "role": "Lead Developer"
            }
        ]
    },
    {
        "id": 2,
        "title": "Voice Agent Framework",
        "description": "The Voice Agent Framework is a modular Python system for building customizable voice assistants by mixing and matching STT (Speech-to-Text), TTS (Text-to-Speech), and LLM (Large Language Model) backends, whether open-source or proprietary. Designed for flexibility, it allows seamless switching between local and cloud-based providers while supporting wake-word activation, configurable audio cues, and automatic silence detection. Key features include modular backends for swapping components without rewriting core logic, hybrid pipelines combining offline models like OpenAI Whisper and Piper TTS with cloud APIs like Gemini and ElevenLabs, and hands-free wake-word activation via Porcupine with audio feedback. This project strengthened my expertise in voice interface architecture, real-time audio processing, and API-agnostic system design, emphasizing clean abstractions for maintainable and extensible AI pipelines.",
        "languages": [
            "python"
        ],
        "technologies": [
            "git",
            "github",
            "numpy",
            "pytorch"
        ],
        "date": {
            "start": {
                "year": 2025,
                "month": 6,
                "day": null
            },
            "end": {
                "year": 2025,
                "month": 6,
                "day": null
            },
            "isOngoing": false
        },
        "repoLink": "https://github.com/b-smyers/voice-agent-framework/",
        "link": null,
        "images": [
            "/images/projects/voice_agent_framework1.png",
            "/images/projects/voice_agent_framework2.png",
            "/images/projects/voice_agent_framework3.jpg",
            "/images/projects/voice_agent_framework4.jpg"
        ],
        "members": [
            {
                "name": "Brendan Smyers",
                "role": "Lead Developer"
            }
        ]
    },
    {
        "id": 3,
        "title": "Battlecode 2024",
        "description": "Battlecode is an AI programming competition where participants build distributed systems to control autonomous agents in a real-time strategy game. For the 2024 challenge, our team developed an AI for a capture-the-flag scenario, focusing on adaptive decision-making and multi-agent coordination. I contributed to both the strategic logic and development infrastructure, implementing intuitive combat heuristics and coordinating weekly team development goals. I also introduced a GitHub Actions-based scrimmage system to benchmark our AI against public competitors, enabling rapid iteration and performance tuning. Our AI placed approximately 16th internationally and remained undefeated in the high school bracket. Through this project, I gained hands-on experience with JUnit, Gradle, and GitHub Actions, while sharpening skills in algorithmic strategy, testing automation, and collaborative version control.",
        "languages": [
            "java"
        ],
        "technologies": [
            "git",
            "github",
            "github-actions",
            "gradle",
            "junit"
        ],
        "date": {
            "start": {
                "year": 2024,
                "month": 1,
                "day": null
            },
            "end": {
                "year": 2024,
                "month": 5,
                "day": null
            },
            "isOngoing": false
        },
        "repoLink": null,
        "link": null,
        "images": [
            "/images/projects/battlecode1.png",
            "/images/projects/battlecode2.png",
            "/images/projects/battlecode3.jpg"
        ],
        "members": [
            {
                "name": "Brendan Smyers",
                "role": "Team Leader"
            },
            {
                "name": "Yuriy Slyvka",
                "role": "Contributor"
            },
            {
                "name": "Chase Morris",
                "role": "Contributor"
            },
            {
                "name": "Dominic Hoiseth",
                "role": "Contributor"
            }
        ]
    },
    {
        "id": 4,
        "title": "Bridge Truss Solver",
        "description": "Bridge Truss Solver is a Python-based tool for analyzing and optimizing truss bridge designs. Developed to support a physics project, the program calculates compressive and tensile forces within bridge members and visualizes stress using a color-coded schematic. It supports custom materials with defined strength thresholds, enabling more realistic simulations. The tool was also an early experiment in automated design, using a basic genetic algorithm to explore optimal structures. While fitness function limitations led to unconventional results, the project offered valuable insight into simulation constraints and algorithmic optimization. Ultimately, the solver was instrumental in developing a bridge that set a still-standing class record based on weight-to-strength ratio. This project marked my first repositroy into GitHub and helped build foundational skills in physics simulation, data visualization, and basic AI-driven design workflows.",
        "languages": [
            "python"
        ],
        "technologies": [
            "git",
            "github",
            "numpy",
            "matplotlib",
            "mongodb"
        ],
        "date": {
            "start": {
                "year": 2022,
                "month": 12,
                "day": null
            },
            "end": {
                "year": 2022,
                "month": 12,
                "day": null
            },
            "isOngoing": false
        },
        "repoLink": "https://github.com/b-smyers/bridge-truss-solver",
        "link": null,
        "images": [
            "/images/projects/truss_solver1.png",
            "/images/projects/truss_solver2.jpg"
        ],
        "members": [
            {
                "name": "Brendan Smyers",
                "role": "Lead Developer"
            }
        ]
    },
    {
        "id": 5,
        "title": "Trebuchet Optimizer",
        "description": "Trebuchet Optimizer is a Python program developed to algorithmically identify optimal trebuchet configurations for maximum projectile distance. Built to support a high school physics challenge, the tool automated interactions with an online simulation platform using Selenium, iteratively adjusting design parameters and logging results to discover high-performing setups. The project provided hands-on experience in data handling with NumPy and Pandas, allowing for sorting, exporting, and analyzing simulation outcomes. The final optimized design was constructed and tested, achieving a 165 ft theoretical range and ~150 ft in practice, within a 9% margin of error, outperforming the site's average 20% discrepancy. This project highlighted the real-world application of software to engineering problems and deepened my skills in automation, parameter tuning, and bridging digital models with physical execution.",
        "languages": [
            "python"
        ],
        "technologies": [
            "git",
            "github",
            "numpy",
            "selenium"
        ],
        "date": {
            "start": {
                "year": 2022,
                "month": 9,
                "day": null
            },
            "end": {
                "year": 2022,
                "month": 10,
                "day": null
            },
            "isOngoing": false
        },
        "repoLink": "https://github.com/b-smyers/trebuchet-optimizer",
        "link": "https://virtualtrebuchet.com/",
        "images": [
            "/images/projects/trebuchet_optimizer1.jpg",
            "/images/projects/trebuchet_optimizer2.jpg",
            "/images/projects/trebuchet_optimizer3.png"
        ],
        "members": [
            {
                "name": "Brendan Smyers",
                "role": "Lead Developer"
            }
        ]
    },
    {
        "id": 6,
        "title": "Steganography Tool",
        "description": "A simple Python-based tool that hides and extracts messages in images using the Least Significant Bit (LSB) steganography technique. Users can interactively encode or decode messages in PNG images via the command line. If your interested, try it out on some of the images in the carousel. You won't be disappointed.",
        "languages": [
            "python"
        ],
        "technologies": [
            "git",
            "github"
        ],
        "date": {
            "start": {
                "year": 2024,
                "month": 9,
                "day": null
            },
            "end": {
                "year": 2024,
                "month": 9,
                "day": null
            },
            "isOngoing": false
        },
        "repoLink": "https://github.com/b-smyers/stenography-tool",
        "link": "https://en.wikipedia.org/wiki/Steganography",
        "images": [
            "/images/projects/steganography1.jpg",
            "/images/projects/steganography2.png",
            "/images/projects/steganography3.png"
        ],
        "members": [
            {
                "name": "Brendan Smyers",
                "role": "Lead Developer"
            }
        ]
    },
    {
        "id": 7,
        "title": "Boop AI Arena",
        "description": "Boop AI Arena is a C++ framework designed to support head-to-head benchmarking of custom AI agents for the game Boop (also known as Gekitai), originally developed as an extension of a class project. After building the core game logic and a basic AI, I expanded the project to allow others to create and test their own strategies in a controlled, terminal-based environment. The system tracks metrics such as average move time, number of turns, and win/loss performance between AIs. I implemented and compared multiple decision-making algorithms, including Minimax and Alpha-Beta Pruning, both of which significantly outperformed the original unoptimized tree search. This project deepened my experience with C++ polymorphism, modular design, and algorithmic evaluation, while reinforcing best practices for structuring and managing medium-sized codebases.",
        "languages": [
            "cpp"
        ],
        "technologies": [
            "git",
            "github"
        ],
        "date": {
            "start": {
                "year": 2023,
                "month": 12,
                "day": null
            },
            "end": {
                "year": 2024,
                "month": 5,
                "day": null
            },
            "isOngoing": false
        },
        "repoLink": "https://github.com/b-smyers/Boop-AI-Arena",
        "link": "https://www.smirkanddagger.com/product-page/boop",
        "images": [
            "/images/projects/boop_ai_arena1.jpg"
        ],
        "members": [
            {
                "name": "Brendan Smyers",
                "role": "Lead Developer"
            }
        ]
    }
]